In [1]:
import pandas as pd
import copy

In [31]:
df = pd.DataFrame(pd.Series([1, 2, 3]), columns=["Category"])
df

   Category
0         1
1         2
2         3

Creating a test dataframe by duplicating df

In [32]:
df1 = copy.deepcopy(df)
df1

   Category
0         1
1         2
2         3

Adding a single column

In [33]:
df1["cities"]  = pd.Series([["Nairobi", "Mombasa"], ["Lagos", "Nigeria"], ["Cape Town", "Johannesburg"]])

Adding multiple columns using the assign function

In [34]:
df1 = df1.assign(
    adult_viewers = pd.Series([500000, 1000000, 750000]),
    aged_viewers = pd.Series([200000, 400000, 300000]),
    young_viewers = pd.Series([1000000, 2000000, 3500000])
)

In [35]:
df1

,Category,cities,adult_viewers,aged_viewers,young_viewers
0,1,"[Nairobi, Mombasa]",500000,200000,1000000
1,2,"[Lagos, Nigeria]",1000000,400000,2000000
2,3,"[Cape Town, Johannesburg]",750000,300000,3500000

To add a new row we use the append function

In [38]:
df1 = df1.append(
    {
        'cities': ["Kolkata", "Hyderabad"],
        'adult_viewers': 2000000,
        'aged_viewers': 2000000,
        'young_viewers': 1500000
    },
    ignore_index =True
 )

In [39]:
df1.head()

,Category,cities,adult_viewers,aged_viewers,young_viewers
0,1.0,"[Nairobi, Mombasa]",500000,200000,1000000
1,2.0,"[Lagos, Nigeria]",1000000,400000,2000000
2,3.0,"[Cape Town, Johannesburg]",750000,300000,3500000
3,NaN,"[Kolkata, Hyderabad]",2000000,2000000,1500000

To duplicate df1 and concatenate

In [41]:
df2 = pd.concat([df1, df1], sort=False)

In [42]:
df2

,Category,cities,adult_viewers,aged_viewers,young_viewers
0,1.0,"[Nairobi, Mombasa]",500000,200000,1000000
1,2.0,"[Lagos, Nigeria]",1000000,400000,2000000
2,3.0,"[Cape Town, Johannesburg]",750000,300000,3500000
3,NaN,"[Kolkata, Hyderabad]",2000000,2000000,1500000
0,1.0,"[Nairobi, Mombasa]",500000,200000,1000000
1,2.0,"[Lagos, Nigeria]",1000000,400000,2000000
2,3.0,"[Cape Town, Johannesburg]",750000,300000,3500000
3,NaN,"[Kolkata, Hyderabad]",2000000,2000000,1500000

To delete a row:

In [43]:
df1 = df1.drop([3])
df1

,Category,cities,adult_viewers,aged_viewers,young_viewers
0,1.0,"[Nairobi, Mombasa]",500000,200000,1000000
1,2.0,"[Lagos, Nigeria]",1000000,400000,2000000
2,3.0,"[Cape Town, Johannesburg]",750000,300000,3500000

To delete a column:

In [45]:
df1 = df1.drop(["aged_viewers"], axis=1)
df1

   Category                     cities  adult_viewers  young_viewers
0       1.0         [Nairobi, Mombasa]         500000        1000000
1       2.0           [Lagos, Nigeria]        1000000        2000000
2       3.0  [Cape Town, Johannesburg]         750000        3500000

We can chain functions as follows(dropping the cities column and dropping duplicates)

In [46]:
df2 = df2.drop(["cities"], axis=1).drop_duplicates()
df2

   Category  adult_viewers  aged_viewers  young_viewers
0       1.0         500000        200000        1000000
1       2.0        1000000        400000        2000000
2       3.0         750000        300000        3500000
3       NaN        2000000       2000000        1500000

Performing operations on the dataframe

In [48]:
df2 = df2.fillna(df2.mean())
df2

   Category  adult_viewers  aged_viewers  young_viewers
0       1.0         500000        200000        1000000
1       2.0        1000000        400000        2000000
2       3.0         750000        300000        3500000
3       2.0        2000000       2000000        1500000

In [49]:
df2["viewers"] = df2["adult_viewers"] + df2["aged_viewers"] + df2["young_viewers"]
df2

   Category  adult_viewers  aged_viewers  young_viewers  viewers
0       1.0         500000        200000        1000000  1700000
1       2.0        1000000        400000        2000000  3400000
2       3.0         750000        300000        3500000  4550000
3       2.0        2000000       2000000        1500000  5500000

In [50]:
df2["expected_clicks"] = 0.03*df2["viewers"]
df2

,Category,adult_viewers,aged_viewers,young_viewers,viewers,expected_clicks
0,1.0,500000,200000,1000000,1700000,51000.0
1,2.0,1000000,400000,2000000,3400000,102000.0
2,3.0,750000,300000,3500000,4550000,136500.0
3,2.0,2000000,2000000,1500000,5500000,165000.0